// Задайте значение N. Напишите программу, которая выведет все натуральные числа в промежутке от N до 1. Выполнить с помощью рекурсии.

// N = 5 -> "5, 4, 3, 2, 1"
// N = 8 -> "8, 7, 6, 5, 4, 3, 2, 1"

// int n = 5;
// GetNumber(n);
// void GetNumber(int n)
// {
//   if (n == 0)
//   {
//     return ;
//   }
//   Console.Write("{0,4}", n);
//   GetNumber(n - 1);
// }
